{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2021/11/29/hello-world/"},{"title":"Build IoT Platform","text":"IoT Architecture ReferenceCloud Provision Edge Device Authentication &amp; Access Control Software &amp; Firmware repo Alerting &amp; Notification Device Shadow Device Lifecycle Management Data Storage &amp; Analysis Device Metadata Management Edge Edge to Cloud Connectivity Things Management Edge Analytics Applications Things Device Connectivity Status Report Command Response Architecture Considerations: Layer of Abstraction, Data flow direction Data Types On ThingsSerial Ports Commands managenent On Edge Devices OS which OS we should use, price, feature support. Docker device management Security thinking Register with Certificate On Platform report device status to send notification to Slack (AWS chatbot, incoming web hooks) difference between Greengrass V1 &amp; V2. V2 didn’t support EventBridge. Lifecycel events management delivery pipeline, artifact/components separation. Thing Type Attribute blocked reprovision. Provision template match existing Thing. fails fir us because greengrass core version upgrade (2.0 to 2.4) Security：permission component configuration，update component configuration need to reset or update. (using deployment config update reset/merge setting) component artifact sizes for download and upload efficiency ECR support IPC with host network vs docker shared network IPC through greengrass socket logs send MQTT event messsage when a device failed deployment. using lambda to send notification reboot a network broken device and Install script failing , timeout debug for docker component Artifact design greengrass Timeout issue, connect to IPC channel Lesson and Learn Node and Python SDK support differently","link":"/2022/04/10/Build-IoT-Platform/"}],"tags":[{"name":"IoT","slug":"IoT","link":"/tags/IoT/"}],"categories":[]}